Tekla Open API Reference for Tekla Structures 2025
GridLineAttributes Constructor
Overload List
Name | Description
GridLine.GridLineAttributes()
 Creates a new default grid line attributes instance that loads standard attributes.
GridLine.GridLineAttributes(String)
 Creates a new grid line attributes instance that loads the specified attributes.
Top
See Also
Reference
GridLine.GridLineAttributes Class
Tekla.Structures.Drawing Namespace